#include <stdio.h>
#include "default.h"
#include "fmul.h"
 
long long int fsqrt(long long int i){
   wire x = init(32,i);
   wire s = extract(x,31,31);
   wire e = extract(x,30,23);
   wire m = extract(x,22,0);
   // 非正規化数の処理
   // 指数が非零偶数なら右に1シフト，奇数ならそのまま，0なら最大偶数個左シフト
   // 上2桁が整数部 1.0 - 3.99999
   wire ma = (bitor(e) && 1-extract(e,0,0).val) ? concat(init(2,1),m) : concat3(init(1,1),m,init(1,0));
   wire ea = concat(add(extract(e,7,7),init(1,1),1),extract(e,6,1));
   // すべて小数部 0.25 - 0.9999
   wire x_in = (eq(extract(ma,24,17),init(8,0b1000000))) ? init(27,0b101101000101000011111100000) :
               (eq(extract(ma,24,17),init(8,0b1000001))) ? init(27,0b101100101110111101000001010) :
               (eq(extract(ma,24,17),init(8,0b1000010))) ? init(27,0b101100011001010110001001000) :
               (eq(extract(ma,24,17),init(8,0b1000011))) ? init(27,0b101100000100001110000110110) :
               (eq(extract(ma,24,17),init(8,0b1000100))) ? init(27,0b101011101111100011110010010) :
               (eq(extract(ma,24,17),init(8,0b1000101))) ? init(27,0b101011011011010110000111000) :
               (eq(extract(ma,24,17),init(8,0b1000110))) ? init(27,0b101011000111100100000011101) :
               (eq(extract(ma,24,17),init(8,0b1000111))) ? init(27,0b101010110100001100101010010) :
               (eq(extract(ma,24,17),init(8,0b1001000))) ? init(27,0b101010100001001110111111101) :
               (eq(extract(ma,24,17),init(8,0b1001001))) ? init(27,0b101010001110101010001011101) :
               (eq(extract(ma,24,17),init(8,0b1001010))) ? init(27,0b101001111100011101011000101) :
               (eq(extract(ma,24,17),init(8,0b1001011))) ? init(27,0b101001101010100111110011110) :
               (eq(extract(ma,24,17),init(8,0b1001100))) ? init(27,0b101001011001001000101100001) :
               (eq(extract(ma,24,17),init(8,0b1001101))) ? init(27,0b101001000111111111010011010) :
               (eq(extract(ma,24,17),init(8,0b1001110))) ? init(27,0b101000110111001010111100110) :
               (eq(extract(ma,24,17),init(8,0b1001111))) ? init(27,0b101000100110101010111110001) :
               (eq(extract(ma,24,17),init(8,0b1010000))) ? init(27,0b101000010110011110101110110) :
               (eq(extract(ma,24,17),init(8,0b1010001))) ? init(27,0b101000000110100101100111110) :
               (eq(extract(ma,24,17),init(8,0b1010010))) ? init(27,0b100111110110111111000011111) :
               (eq(extract(ma,24,17),init(8,0b1010011))) ? init(27,0b100111100111101010011111100) :
               (eq(extract(ma,24,17),init(8,0b1010100))) ? init(27,0b100111011000100111011000100) :
               (eq(extract(ma,24,17),init(8,0b1010101))) ? init(27,0b100111001001110101001110001) :
               (eq(extract(ma,24,17),init(8,0b1010110))) ? init(27,0b100110111011010011100000111) :
               (eq(extract(ma,24,17),init(8,0b1010111))) ? init(27,0b100110101101000001110010100) :
               (eq(extract(ma,24,17),init(8,0b1011000))) ? init(27,0b100110011110111111100110001) :
               (eq(extract(ma,24,17),init(8,0b1011001))) ? init(27,0b100110010001001100011111111) :
               (eq(extract(ma,24,17),init(8,0b1011010))) ? init(27,0b100110000011101000000101001) :
               (eq(extract(ma,24,17),init(8,0b1011011))) ? init(27,0b100101110110010001111011111) :
               (eq(extract(ma,24,17),init(8,0b1011100))) ? init(27,0b100101101001001001101011100) :
               (eq(extract(ma,24,17),init(8,0b1011101))) ? init(27,0b100101011100001110111100010) :
               (eq(extract(ma,24,17),init(8,0b1011110))) ? init(27,0b100101001111100001010111001) :
               (eq(extract(ma,24,17),init(8,0b1011111))) ? init(27,0b100101000011000000100101111) :
               (eq(extract(ma,24,17),init(8,0b1100000))) ? init(27,0b100100110110101100010011011) :
               (eq(extract(ma,24,17),init(8,0b1100001))) ? init(27,0b100100101010100100001011001) :
               (eq(extract(ma,24,17),init(8,0b1100010))) ? init(27,0b100100011110100111111001001) :
               (eq(extract(ma,24,17),init(8,0b1100011))) ? init(27,0b100100010010110111001010011) :
               (eq(extract(ma,24,17),init(8,0b1100100))) ? init(27,0b100100000111010001101100100) :
               (eq(extract(ma,24,17),init(8,0b1100101))) ? init(27,0b100011111011110111001101110) :
               (eq(extract(ma,24,17),init(8,0b1100110))) ? init(27,0b100011110000100111011100101) :
               (eq(extract(ma,24,17),init(8,0b1100111))) ? init(27,0b100011100101100010001000111) :
               (eq(extract(ma,24,17),init(8,0b1101000))) ? init(27,0b100011011010100111000010011) :
               (eq(extract(ma,24,17),init(8,0b1101001))) ? init(27,0b100011001111110101111001011) :
               (eq(extract(ma,24,17),init(8,0b1101010))) ? init(27,0b100011000101001110011111001) :
               (eq(extract(ma,24,17),init(8,0b1101011))) ? init(27,0b100010111010110000100101000) :
               (eq(extract(ma,24,17),init(8,0b1101100))) ? init(27,0b100010110000011011111101000) :
               (eq(extract(ma,24,17),init(8,0b1101101))) ? init(27,0b100010100110010000011001100) :
               (eq(extract(ma,24,17),init(8,0b1101110))) ? init(27,0b100010011100001101101101011) :
               (eq(extract(ma,24,17),init(8,0b1101111))) ? init(27,0b100010010010010011101011110) :
               (eq(extract(ma,24,17),init(8,0b1110000))) ? init(27,0b100010001000100010001000100) :
               (eq(extract(ma,24,17),init(8,0b1110001))) ? init(27,0b100001111110111000110111011) :
               (eq(extract(ma,24,17),init(8,0b1110010))) ? init(27,0b100001110101010111101101000) :
               (eq(extract(ma,24,17),init(8,0b1110011))) ? init(27,0b100001101011111110011110001) :
               (eq(extract(ma,24,17),init(8,0b1110100))) ? init(27,0b100001100010101100111111101) :
               (eq(extract(ma,24,17),init(8,0b1110101))) ? init(27,0b100001011001100011000111001) :
               (eq(extract(ma,24,17),init(8,0b1110110))) ? init(27,0b100001010000100000101010010) :
               (eq(extract(ma,24,17),init(8,0b1110111))) ? init(27,0b100001000111100101011111000) :
               (eq(extract(ma,24,17),init(8,0b1111000))) ? init(27,0b100000111110110001011011111) :
               (eq(extract(ma,24,17),init(8,0b1111001))) ? init(27,0b100000110110000100010111010) :
               (eq(extract(ma,24,17),init(8,0b1111010))) ? init(27,0b100000101101011110001000000) :
               (eq(extract(ma,24,17),init(8,0b1111011))) ? init(27,0b100000100100111110100101100) :
               (eq(extract(ma,24,17),init(8,0b1111100))) ? init(27,0b100000011100100101100110111) :
               (eq(extract(ma,24,17),init(8,0b1111101))) ? init(27,0b100000010100010011000011110) :
               (eq(extract(ma,24,17),init(8,0b1111110))) ? init(27,0b100000001100000110110100010) :
               (eq(extract(ma,24,17),init(8,0b1111111))) ? init(27,0b100000000100000000110000001) :
               (eq(extract(ma,24,17),init(8,0b10000000))) ? init(27,0b11111111100000000101111110) :
               (eq(extract(ma,24,17),init(8,0b10000001))) ? init(27,0b11111110100000110101011110) :
               (eq(extract(ma,24,17),init(8,0b10000010))) ? init(27,0b11111101100010010011100110) :
               (eq(extract(ma,24,17),init(8,0b10000011))) ? init(27,0b11111100100100011111011101) :
               (eq(extract(ma,24,17),init(8,0b10000100))) ? init(27,0b11111011100111011000001011) :
               (eq(extract(ma,24,17),init(8,0b10000101))) ? init(27,0b11111010101010111100111100) :
               (eq(extract(ma,24,17),init(8,0b10000110))) ? init(27,0b11111001101111001100111010) :
               (eq(extract(ma,24,17),init(8,0b10000111))) ? init(27,0b11111000110100000111010010) :
               (eq(extract(ma,24,17),init(8,0b10001000))) ? init(27,0b11110111111001101011010011) :
               (eq(extract(ma,24,17),init(8,0b10001001))) ? init(27,0b11110110111111111000001100) :
               (eq(extract(ma,24,17),init(8,0b10001010))) ? init(27,0b11110110000110101101001101) :
               (eq(extract(ma,24,17),init(8,0b10001011))) ? init(27,0b11110101001110001001101001) :
               (eq(extract(ma,24,17),init(8,0b10001100))) ? init(27,0b11110100010110001100110011) :
               (eq(extract(ma,24,17),init(8,0b10001101))) ? init(27,0b11110011011110110101111110) :
               (eq(extract(ma,24,17),init(8,0b10001110))) ? init(27,0b11110010101000000100100000) :
               (eq(extract(ma,24,17),init(8,0b10001111))) ? init(27,0b11110001110001110111101111) :
               (eq(extract(ma,24,17),init(8,0b10010000))) ? init(27,0b11110000111100001111000011) :
               (eq(extract(ma,24,17),init(8,0b10010001))) ? init(27,0b11110000000111001001110100) :
               (eq(extract(ma,24,17),init(8,0b10010010))) ? init(27,0b11101111010010100111011011) :
               (eq(extract(ma,24,17),init(8,0b10010011))) ? init(27,0b11101110011110100111010001) :
               (eq(extract(ma,24,17),init(8,0b10010100))) ? init(27,0b11101101101011001000110011) :
               (eq(extract(ma,24,17),init(8,0b10010101))) ? init(27,0b11101100111000001011011100) :
               (eq(extract(ma,24,17),init(8,0b10010110))) ? init(27,0b11101100000101101110101001) :
               (eq(extract(ma,24,17),init(8,0b10010111))) ? init(27,0b11101011010011110001111000) :
               (eq(extract(ma,24,17),init(8,0b10011000))) ? init(27,0b11101010100010010100100101) :
               (eq(extract(ma,24,17),init(8,0b10011001))) ? init(27,0b11101001110001010110010010) :
               (eq(extract(ma,24,17),init(8,0b10011010))) ? init(27,0b11101001000000110110011110) :
               (eq(extract(ma,24,17),init(8,0b10011011))) ? init(27,0b11101000010000110100101000) :
               (eq(extract(ma,24,17),init(8,0b10011100))) ? init(27,0b11100111100001010000010100) :
               (eq(extract(ma,24,17),init(8,0b10011101))) ? init(27,0b11100110110010001001000010) :
               (eq(extract(ma,24,17),init(8,0b10011110))) ? init(27,0b11100110000011011110010101) :
               (eq(extract(ma,24,17),init(8,0b10011111))) ? init(27,0b11100101010101001111110000) :
               (eq(extract(ma,24,17),init(8,0b10100000))) ? init(27,0b11100100100111011100111000) :
               (eq(extract(ma,24,17),init(8,0b10100001))) ? init(27,0b11100011111010000101010001) :
               (eq(extract(ma,24,17),init(8,0b10100010))) ? init(27,0b11100011001101001000100000) :
               (eq(extract(ma,24,17),init(8,0b10100011))) ? init(27,0b11100010100000100110001010) :
               (eq(extract(ma,24,17),init(8,0b10100100))) ? init(27,0b11100001110100011101110111) :
               (eq(extract(ma,24,17),init(8,0b10100101))) ? init(27,0b11100001001000101111001100) :
               (eq(extract(ma,24,17),init(8,0b10100110))) ? init(27,0b11100000011101011001110001) :
               (eq(extract(ma,24,17),init(8,0b10100111))) ? init(27,0b11011111110010011101001110) :
               (eq(extract(ma,24,17),init(8,0b10101000))) ? init(27,0b11011111000111111001001100) :
               (eq(extract(ma,24,17),init(8,0b10101001))) ? init(27,0b11011110011101101101010010) :
               (eq(extract(ma,24,17),init(8,0b10101010))) ? init(27,0b11011101110011111001001011) :
               (eq(extract(ma,24,17),init(8,0b10101011))) ? init(27,0b11011101001010011100100000) :
               (eq(extract(ma,24,17),init(8,0b10101100))) ? init(27,0b11011100100001010110111100) :
               (eq(extract(ma,24,17),init(8,0b10101101))) ? init(27,0b11011011111000101000001001) :
               (eq(extract(ma,24,17),init(8,0b10101110))) ? init(27,0b11011011010000001111110010) :
               (eq(extract(ma,24,17),init(8,0b10101111))) ? init(27,0b11011010101000001101100010) :
               (eq(extract(ma,24,17),init(8,0b10110000))) ? init(27,0b11011010000000100001000110) :
               (eq(extract(ma,24,17),init(8,0b10110001))) ? init(27,0b11011001011001001010001010) :
               (eq(extract(ma,24,17),init(8,0b10110010))) ? init(27,0b11011000110010001000011011) :
               (eq(extract(ma,24,17),init(8,0b10110011))) ? init(27,0b11011000001011011011100110) :
               (eq(extract(ma,24,17),init(8,0b10110100))) ? init(27,0b11010111100101000011010111) :
               (eq(extract(ma,24,17),init(8,0b10110101))) ? init(27,0b11010110111110111111011110) :
               (eq(extract(ma,24,17),init(8,0b10110110))) ? init(27,0b11010110011001001111100111) :
               (eq(extract(ma,24,17),init(8,0b10110111))) ? init(27,0b11010101110011110011100010) :
               (eq(extract(ma,24,17),init(8,0b10111000))) ? init(27,0b11010101001110101010111110) :
               (eq(extract(ma,24,17),init(8,0b10111001))) ? init(27,0b11010100101001110101101001) :
               (eq(extract(ma,24,17),init(8,0b10111010))) ? init(27,0b11010100000101010011010100) :
               (eq(extract(ma,24,17),init(8,0b10111011))) ? init(27,0b11010011100001000011101101) :
               (eq(extract(ma,24,17),init(8,0b10111100))) ? init(27,0b11010010111101000110100101) :
               (eq(extract(ma,24,17),init(8,0b10111101))) ? init(27,0b11010010011001011011101100) :
               (eq(extract(ma,24,17),init(8,0b10111110))) ? init(27,0b11010001110110000010110100) :
               (eq(extract(ma,24,17),init(8,0b10111111))) ? init(27,0b11010001010010111011101100) :
               (eq(extract(ma,24,17),init(8,0b11000000))) ? init(27,0b11010000110000000110000110) :
               (eq(extract(ma,24,17),init(8,0b11000001))) ? init(27,0b11010000001101100001110100) :
               (eq(extract(ma,24,17),init(8,0b11000010))) ? init(27,0b11001111101011001110100111) :
               (eq(extract(ma,24,17),init(8,0b11000011))) ? init(27,0b11001111001001001100010010) :
               (eq(extract(ma,24,17),init(8,0b11000100))) ? init(27,0b11001110100111011010100110) :
               (eq(extract(ma,24,17),init(8,0b11000101))) ? init(27,0b11001110000101111001010110) :
               (eq(extract(ma,24,17),init(8,0b11000110))) ? init(27,0b11001101100100101000010101) :
               (eq(extract(ma,24,17),init(8,0b11000111))) ? init(27,0b11001101000011100111010110) :
               (eq(extract(ma,24,17),init(8,0b11001000))) ? init(27,0b11001100100010110110001011) :
               (eq(extract(ma,24,17),init(8,0b11001001))) ? init(27,0b11001100000010010100101010) :
               (eq(extract(ma,24,17),init(8,0b11001010))) ? init(27,0b11001011100010000010100100) :
               (eq(extract(ma,24,17),init(8,0b11001011))) ? init(27,0b11001011000001111111101110) :
               (eq(extract(ma,24,17),init(8,0b11001100))) ? init(27,0b11001010100010001011111100) :
               (eq(extract(ma,24,17),init(8,0b11001101))) ? init(27,0b11001010000010100111000010) :
               (eq(extract(ma,24,17),init(8,0b11001110))) ? init(27,0b11001001100011010000110101) :
               (eq(extract(ma,24,17),init(8,0b11001111))) ? init(27,0b11001001000100001001001001) :
               (eq(extract(ma,24,17),init(8,0b11010000))) ? init(27,0b11001000100101001111110011) :
               (eq(extract(ma,24,17),init(8,0b11010001))) ? init(27,0b11001000000110100100101000) :
               (eq(extract(ma,24,17),init(8,0b11010010))) ? init(27,0b11000111101000000111011110) :
               (eq(extract(ma,24,17),init(8,0b11010011))) ? init(27,0b11000111001001111000001010) :
               (eq(extract(ma,24,17),init(8,0b11010100))) ? init(27,0b11000110101011110110100000) :
               (eq(extract(ma,24,17),init(8,0b11010101))) ? init(27,0b11000110001110000010011000) :
               (eq(extract(ma,24,17),init(8,0b11010110))) ? init(27,0b11000101110000011011100111) :
               (eq(extract(ma,24,17),init(8,0b11010111))) ? init(27,0b11000101010011000010000011) :
               (eq(extract(ma,24,17),init(8,0b11011000))) ? init(27,0b11000100110101110101100011) :
               (eq(extract(ma,24,17),init(8,0b11011001))) ? init(27,0b11000100011000110101111011) :
               (eq(extract(ma,24,17),init(8,0b11011010))) ? init(27,0b11000011111100000011000101) :
               (eq(extract(ma,24,17),init(8,0b11011011))) ? init(27,0b11000011011111011100110101) :
               (eq(extract(ma,24,17),init(8,0b11011100))) ? init(27,0b11000011000011000011000011) :
               (eq(extract(ma,24,17),init(8,0b11011101))) ? init(27,0b11000010100110110101100101) :
               (eq(extract(ma,24,17),init(8,0b11011110))) ? init(27,0b11000010001010110100010100) :
               (eq(extract(ma,24,17),init(8,0b11011111))) ? init(27,0b11000001101110111111000101) :
               (eq(extract(ma,24,17),init(8,0b11100000))) ? init(27,0b11000001010011010101110001) :
               (eq(extract(ma,24,17),init(8,0b11100001))) ? init(27,0b11000000110111111000001111) :
               (eq(extract(ma,24,17),init(8,0b11100010))) ? init(27,0b11000000011100100110010111) :
               (eq(extract(ma,24,17),init(8,0b11100011))) ? init(27,0b11000000000001100000000001) :
               (eq(extract(ma,24,17),init(8,0b11100100))) ? init(27,0b10111111100110100101000100) :
               (eq(extract(ma,24,17),init(8,0b11100101))) ? init(27,0b10111111001011110101011000) :
               (eq(extract(ma,24,17),init(8,0b11100110))) ? init(27,0b10111110110001010000110110) :
               (eq(extract(ma,24,17),init(8,0b11100111))) ? init(27,0b10111110010110110111010110) :
               (eq(extract(ma,24,17),init(8,0b11101000))) ? init(27,0b10111101111100101000110000) :
               (eq(extract(ma,24,17),init(8,0b11101001))) ? init(27,0b10111101100010100100111101) :
               (eq(extract(ma,24,17),init(8,0b11101010))) ? init(27,0b10111101001000101011110110) :
               (eq(extract(ma,24,17),init(8,0b11101011))) ? init(27,0b10111100101110111101010011) :
               (eq(extract(ma,24,17),init(8,0b11101100))) ? init(27,0b10111100010101011001001101) :
               (eq(extract(ma,24,17),init(8,0b11101101))) ? init(27,0b10111011111011111111011101) :
               (eq(extract(ma,24,17),init(8,0b11101110))) ? init(27,0b10111011100010101111111100) :
               (eq(extract(ma,24,17),init(8,0b11101111))) ? init(27,0b10111011001001101010100100) :
               (eq(extract(ma,24,17),init(8,0b11110000))) ? init(27,0b10111010110000101111001101) :
               (eq(extract(ma,24,17),init(8,0b11110001))) ? init(27,0b10111010010111111101110000) :
               (eq(extract(ma,24,17),init(8,0b11110010))) ? init(27,0b10111001111111010110001000) :
               (eq(extract(ma,24,17),init(8,0b11110011))) ? init(27,0b10111001100110111000001110) :
               (eq(extract(ma,24,17),init(8,0b11110100))) ? init(27,0b10111001001110100011111011) :
               (eq(extract(ma,24,17),init(8,0b11110101))) ? init(27,0b10111000110110011001001010) :
               (eq(extract(ma,24,17),init(8,0b11110110))) ? init(27,0b10111000011110010111110011) :
               (eq(extract(ma,24,17),init(8,0b11110111))) ? init(27,0b10111000000110011111110010) :
               (eq(extract(ma,24,17),init(8,0b11111000))) ? init(27,0b10110111101110110000111111) :
               (eq(extract(ma,24,17),init(8,0b11111001))) ? init(27,0b10110111010111001011010101) :
               (eq(extract(ma,24,17),init(8,0b11111010))) ? init(27,0b10110110111111101110101110) :
               (eq(extract(ma,24,17),init(8,0b11111011))) ? init(27,0b10110110101000011011000101) :
               (eq(extract(ma,24,17),init(8,0b11111100))) ? init(27,0b10110110010001010000010100) :
               (eq(extract(ma,24,17),init(8,0b11111101))) ? init(27,0b10110101111010001110010100) :
               (eq(extract(ma,24,17),init(8,0b11111110))) ? init(27,0b10110101100011010101000001) : init(27,0b10110101001100100100010101);

   // ニュートン法1回目
   // x_out = x_in*(3-a*x_in**2)*(1/2)
   // x_in*(3-a*x_in**2) 上三桁が整数部
   // 上1桁が整数部 1程度
   wire k1 = mul(concat(init(2,0),ma),x_in,23);
	// logic [24:0] ma1;
	// logic [22:0] m3;
	// logic [7:0] ea1;
	// logic s1;
	// logic [26:0] x_in1;
	// logic [50:0] k11;
	// logic [31:0] x1;
	// logic [7:0] e1;
	// logic enable_in1;
	// always @(posedge clk) begin
	// 	ma1 <= ma;
	// 	m3 <= m;
	// 	ea1 <= ea;
	// 	s1 <= s;
	// 	x_in1 <= x_in;
	// 	k11 <= k1;
	// 	x1 <= x;
	// 	e1 <= e;
	// 	enable_in1 <= enable_in;
	// end
   // すべて小数部 0.0625 - 0.9999
   wire l1 = mul(extract(x_in,26,2),extract(x_in,26,2),25);
   // 上1桁が整数部 1以下ぐらい
   wire m1 = mul(extract(k1,50,26),extract(l1,49,25),25);
	// logic [24:0] ma2;
	// logic [22:0] m4;
	// logic [7:0] ea2;
	// logic [26:0] x_in2;
	// logic s2;
	// logic [49:0] m11;
	// logic [31:0] x2;
	// logic [7:0] e2;
	// logic enable_in2;
	// always @(posedge clk) begin
	// 	ma2 <= ma1;
	// 	m4 <= m3;
	// 	ea2 <= ea1;
	// 	x_in2 <= x_in1;
	// 	s2 <= s1;
	// 	m11 <= m1;
	// 	x2 <= x1;
	// 	e2 <= e1;
	// 	enable_in2 <= enable_in1;
	// end
   // 上2桁が整数部 0.75 - 2.9999
   wire n1 = add(concat(x_in,init(1,0)),concat(init(1,0),x_in),1);
   wire p1 = sub(concat(n1,init(1,0)),extract(m1,49,20),0);
   // 切り上げるのは p1[74]が1かつ(p1[73:0]が0より大きい または p1[75]が1)
   // すべて小数部
   wire x_out1 = (extract(p1,1,1).val && (extract(p1,0,0).val || extract(p1,2,2).val)) ? add(extract(p1,28,2),init(27,1),0) : extract(p1,28,2);
   // ニュートン法2回目
   wire k2 = mul(concat(init(2,0),ma),x_out1,23);
   wire l2 = mul(extract(x_out1,26,2),extract(x_out1,26,2),25);
   wire m2 = mul(extract(k2,50,26),extract(l2,49,25),25);
   wire n2 = add(concat(x_out1,init(1,0)),concat(init(1,0),x_out1),1);
   wire p2 = sub(concat(n2,init(1,0)),extract(m2,49,20),0);
   wire x_out2 = (extract(p2,1,1).val && (extract(p2,0,0).val || extract(p2,2,2).val)) ? add(extract(p2,28,2),init(27,1),0) : extract(p2,28,2);

   // wire [50:0] k2 = {26'b0,ma2} * {23'b0,x_out1};
   // wire [49:0] l2 = {25'b0,x_out1[26:2]} * {25'b0,x_out1[26:2]};
	// logic [7:0] e3;
	// logic [26:0] x_out11;
	// logic [22:0] m5;
	// logic [7:0] ea3;
	// logic [50:0] k21;
	// logic s3;
	// logic [49:0] l21;
	// logic [31:0] x3;
	// logic enable_in3;
	// always @(posedge clk) begin
	// 	e3 <= e2;
	// 	x_out11 <= x_out1;
	// 	m5 <= m4;
	// 	ea3 <= ea2;
	// 	k21 <= k2;
	// 	s3 <= s2;
	// 	l21 <= l2;
	// 	x3 <= x2;
	// 	enable_in3 <= enable_in2;
	// end
   // wire [49:0] m2 = {25'b0,k21[50:26]} * {25'b0,l21[49:25]};
   // wire [29:0] n2 = {1'b0,x_out11,1'b0} + {2'b0,x_out11};
   // wire [30:0] p2 = {n2,1'b0} - {1'b0,m2[49:20]};
   // wire [26:0] x_out2 = (p2[1:1] && (p2[0:0] || p2[2:2])) ? {p2[28:2]} + 28'b1 : {p2[28:2]};

   
   wire mye = (extract(x_out2,26,26).val) ? ((extract(x_out2,2,2).val) ? add(extract(x_out2,26,3),init(24,1),1) : concat(init(1,0),extract(x_out2,26,3))) :
              (extract(x_out2,1,1).val) ? add(extract(x_out2,25,2),init(24,1),1) : concat(init(1,0),extract(x_out2,25,2));

   wire my = (extract(mye,24,24).val) ? init(23,0) : extract(mye,22,0);

   wire eye = (extract(x_out2,26,26).val) ? sub(init(8,254),ea,0) : sub(init(8,253),ea,0);

   wire ey = (extract(mye,24,24).val) ? add(eye,init(8,1),0) : eye;
	// logic [7:0] e4;
	// logic [22:0] m6;
	// logic s4;
	// logic [7:0] ey1;
	// logic [31:0] x4;
	// logic [22:0] my1;
	// logic enable_in4;
	// always @(posedge clk) begin
	// 	e4 <= e3;
	// 	m6 <= m5;
	// 	s4 <= s3;
	// 	ey1 <= ey;
	// 	x4 <= x3;
	// 	my1 <= my;
	// 	enable_in4 <= enable_in3;
	// end

   // wire [31:0] y_mul;
   // wire ovf;
   wire y_mul = init(32,fmul(x.val,concat3(s,ey,my).val));

   // nanかどうかの判定
   int nzm = bitor(m);
   wire y = (eq(e,init(8,255)) && nzm) ? concat3(s,init(9,511),extract(m,21,0)) : // 元がnanなら結果もnan
            (s.val == 0 && eq(e,init(8,255)) && 1-nzm) ? concat3(init(1,0),init(8,255),init(23,0)) : // 元が+infなら結果は+inf
            (1-bitor(x)) ? concat3(init(1,0),init(8,0),init(23,0)) : // 元が+0なら結果は+0
            (s.val == 1 && 1-bitor(extract(x,30,0))) ? concat3(init(1,1),init(8,0),init(23,0)) : // 元が-0なら結果は-0
            (s.val == 1) ? concat3(init(1,1),init(9,511),init(22,0)) : // 負の数なら-nan
            (eq(extract(x,31,0),init(32,0b111111100111011101011))) ? init(32,0b11111011111110011101101100000) : y_mul; // 何故かこれだけ2ずれちゃう
   return y.val; 
}